lab-4/web_scraper/app/views/student/index.html.erb

</div>
<% if current_user.student_application.present? %>
---
SELECT "student_applications".* FROM "student_applications" WHERE "student_applications"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]