lab-4/web_scraper/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.all

UPDATE "courses" SET "updated_at" = $1, "weekdays" = $2 WHERE "courses"."id" = $3  [["updated_at", "2021-12-01 22:42:00.231818"], ["weekdays", "This class meets NEVER"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find(params[:id])