lab-4/web_scraper/app/controllers/instructor_recommendation_controller.rb

SELECT "instructor_recommendations".* FROM "instructor_recommendations"
---
  def index
    @recommendations = InstructorRecommendation.all

INSERT INTO "instructor_recommendations" ("name", "email", "created_at", "updated_at", "student_name", "message") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "a"], ["email", "b"], ["created_at", "2021-11-30 04:36:33.170312"], ["updated_at", "2021-11-30 04:36:33.170312"], ["student_name", "c"], ["message", "d"]]
---
  def create
    @instructor_recommendation = InstructorRecommendation.new(user_params)
    if @instructor_recommendation.save