lab-4/web_scraper/app/controllers/student_application_controller.rb

  def index
    @applications = StudentApplication.all
---
SELECT "student_applications".* FROM "student_applications"

  def new
    if current_user.student_application.present?
---
SELECT "student_applications".* FROM "student_applications" WHERE "student_applications"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def update
    @student_application = current_user.student_application
    if @student_application.update(params.require(:student_application).permit(:email, :name, :phone_number, :desired_courses, :taken_courses, :availability))
---
UPDATE "student_applications" SET "phone_number" = $1, "updated_at" = $2 WHERE "student_applications"."id" = $3  [["phone_number", "234234234"], ["updated_at", "2021-11-30 22:16:25.865679"], ["id", 35]]

  def create
    @student_application = StudentApplication.new(user_params.merge(user_id: current_user.id))
    if @student_application.save
---
INSERT INTO "student_applications" ("email", "name", "phone_number", "desired_courses", "taken_courses", "availability", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"