lab-4/web_scraper/app/controllers/student_application_controller.rb

  def create
    @student_application = StudentApplication.new(user_params)
    if @student_application.save
---
INSERT INTO "student_applications" ("email", "name", "phone_number", "desired_courses", "taken_courses", "availability", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"